# LEET CODE
## Problem-1873: Calculate Special Bonus
Class: Easy

Source: https://leetcode.com/problems/calculate-special-bonus/

## Description
Table: Employees
| Column Name | Type    |
|-------------|---------|
| employee_id | int     |
| name        | varchar |
| salary      | int     |

- employee_id is the primary key (column with unique values) for this table.
- Each row of this table indicates the employee ID, employee name, and salary.

## To Do
Write a solution to calculate the bonus of each employee. The bonus of an employee is 100% of their salary if the ID of the employee is an odd number and the employee's name does not start with the character 'M'. The bonus of an employee is 0 otherwise.

Return the result table ordered by employee_id.

The result format is in the following example.

## Example

Input: 

Employees table:
| employee_id | name    | salary |
|-------------|---------|--------|
| 2           | Meir    | 3000   |
| 3           | Michael | 3800   |
| 7           | Addilyn | 7400   |
| 8           | Juan    | 6100   |
| 9           | Kannon  | 7700   |

Output: 
| employee_id | bonus |
|-------------|-------|
| 2           | 0     |
| 3           | 0     |
| 7           | 7400  |
| 8           | 0     |
| 9           | 7700  |

Explanation: 
- The employees with IDs 2 and 8 get 0 bonus because they have an even employee_id.
- The employee with ID 3 gets 0 bonus because their name starts with 'M'.
- The rest of the employees get a 100% bonus.

## Importing

In [1]:
import pandas as pd
from pandasql import sqldf

## Define Schema

In [2]:
data = [[2, 'Meir', 3000], [3, 'Michael', 3800], [7, 'Addilyn', 7400], [8, 'Juan', 6100], [9, 'Kannon', 7700]]
Employees = pd.DataFrame(data, columns=['employee_id', 'name', 'salary']).astype({'employee_id':'int64', 'name':'object', 'salary':'int64'})

Employees

   employee_id     name  salary
0            2     Meir    3000
1            3  Michael    3800
2            7  Addilyn    7400
3            8     Juan    6100
4            9   Kannon    7700

## Task

In [5]:
# Define the SQL query
query = """
SELECT employee_id,
    CASE
        WHEN employee_id %2 != 0 AND name NOT LIKE "M%" THEN salary
        ELSE 0
    END AS bonus
FROM Employees
ORDER BY employee_id
;
"""

# Excute the query using pandasql
result = sqldf(query, env={'Employees':Employees})

# Display the result dataframe
display(result)

   employee_id  bonus
0            2      0
1            3      0
2            7   7400
3            8      0
4            9   7700